In [ ]:
from tkinter import *

window = Tk()
window.title("Hello, NIET!")

label = Label(window, text ="Hello Students!", font=("Arial Bold", 20))
label.config(bg = "red", fg = "white")
label.pack()
window.mainloop()

In [ ]:
from tkinter import *

window = Tk()
window.title("Hello, NIET!")

label = Label(window, text ="Hello Students!", font=("Arial Bold", 20))
label.config(bg = "red", fg = "white")
label.pack()
window.mainloop()

In [ ]:
from tkinter import *

window = Tk()
window.title("Hello, NIET!")

label = Label(window, text ="Hello Students!", font=("Arial Bold", 20))
label.config(bg = "red", fg = "white")
label.pack(side="top", padx=40, pady=20)
window.mainloop()

In [ ]:
from tkinter import *

# Create the main window which is an object of Tk class
window = Tk()
window.title("Hello, NIET!")

def button_clicked():
    buton.config(text="Good Job",bg = "red", fg = "white")
    
button = Button(window, text ="Hello Students! Click Me", command=button_clicked, font=("Arial Bold", 20))
button.config(bg = "red", fg = "white")
button.pack(side="top", padx=40, pady=20)

window.mainloop()

In [ ]:
from tkinter import *

# Create the main window which is an object of Tk class
window = Tk()
window.title("Hello, NIET!")

def button_clicked():
    buton.config(text="Good Job",bg = "red", fg = "white")
    
button = Button(window, text ="Hello Students! Click Me", command=button_clicked, font=("Arial Bold", 20))
button.config(bg = "red", fg = "white")
button.pack(side="top", padx=40, pady=20)

window.mainloop()

In [ ]:
import tkinter as tk

# Create the main window which is an object of Tk class
window = tk.Tk()
window.title("Scale Example")
window.geometry("800x200")
    
scale = tk.Scale(window, from_=0, to=100, orient=tk.HORIZONTAL)
scale.pack()

window.mainloop()

In [ ]:
import tkinter as tk

# Create the main window which is an object of Tk class
window = tk.Tk()
window.title("Spinbox Example")
window.geometry("800x200")
    
scale = tk.Spinbox(window, from_=0, to=100)
scale.pack()

window.mainloop()

In [ ]:
import tkinter as tk

window = Tk()
window.title("Checkbutton Example")
window.geometry("800x200")

check_var = tk.BooleanVar()
checkbutton = tk.Checkbutton(window, text="Check me", variable=check_var)
checkbutton.pack()

window.mainloop()

In [ ]:
import tkinter as tk

window = Tk()
window.title("Radiobutton Example")
window.geometry("800x200")

radio_var = tk.StringVar()
radiobutton1 = tk.Radiobutton(window, text="Male", variable=radio_var, value="Male")
radiobutton2 = tk.Radiobutton(window, text="Female", variable=radio_var, value="Female")

radiobutton1.pack()
radiobutton2.pack()

window.mainloop()

In [ ]:
import tkinter as tk

window = Tk()
window.title("Listbox Example")
window.geometry("800x200")

listbox = tk.Listbox(window)
listbox.insert(1, "Option 1")
listbox.insert(2, "Option 2")
listbox.insert(3, "Option 3")
listbox.pack()

window.mainloop()

In [ ]:
import tkinter as tk
from tkinter.ttk import Combobox
from tkinter.ttk import Label

window = tk.Tk()
window.title("Combobox Example")
window.geometry("800x200")

def combobox_selected(event):
    selected_value = combobox_get()
    label.config(text=f"Selected: {selected_value}")
    
label = Label(window, text="Select an Option: ")
label.pack(padx=40, pady=20)

options = ["Option 1", "Option 2", "Option 3"]
combobox = Combobox(window, values=options)
combobox.pack(padx=40, pady=20)

combobox.bind("<<ComboboxSelected>>", combobox_selected)

window.mainloop()

In [ ]:
from tkinter import *

window = tk.Tk()
window.title("String Example")
window.geometry("800x200")

label = Label(window, text="Enter here").pack(pady=10)
entry = Entry(window)
entry.pack()

window.mainloop()

In [28]:
from tkinter import *

window = Tk()
window.title("Login Form")

username_label = Label(window, text="Username: ")
username_label.pack(padx=40, pady=20)

password_label = Label(window, text="Password: ")  # âœ… Define it
password_label.pack(padx=40, pady=20)  
print(password_label)

.!label2

In [30]:
from tkinter import *
from tkcalendar import DateEntry

root = tk.Tk()
root.title("Date Picker Example")
root.geometry("800x200")

# Create a DateEntry widget
date_entry = DateEntry(root)
date_entry.pack()

root.mainloop()

In [ ]:
import pandas as pd
import pandas as pd

ser_2 = pd.Series([1, 1, 2, -3, -5], index = ['a','b', 'c', 'd', 'e'])
print(ser_2)

In [ ]:
ser_2[ser_2 > 0]

In [ ]:
print(ser_2)
print(ser_2*2)

In [17]:
import numpy as np
np.exp(ser_2)

a    2.718282
b    2.718282
c    7.389056
d    0.049787
e    0.006738
dtype: float64

In [16]:
import pandas as pd

dict_1 = {'foo' : 100, 'bar' : 200, 'baz' : 300}
ser_3 = pd.Series(dict_1)
print(dict_1)
print(ser_3)

{'foo': 100, 'bar': 200, 'baz': 300}
foo    100
bar    200
baz    300
dtype: int64

In [15]:
import pandas as pd

index = {'foo', 'bar', 'baz', 'qux'}
ser_4 = pd.Series(dict_1, index=index)
ser_4

baz    300.0
bar    200.0
foo    100.0
qux      NaN
dtype: float64

In [18]:
pd.isnull(ser_4)

baz    False
bar    False
foo    False
qux     True
dtype: bool

In [20]:
print(ser_3)
print("----------------------------------------------------")
print(ser_4)
print("----------------------------------------------------")
print(ser_3+ser_4)
print("----------------------------------------------------")

foo    100
bar    200
baz    300
dtype: int64
----------------------------------------------------
baz    300.0
bar    200.0
foo    100.0
qux      NaN
dtype: float64
----------------------------------------------------
bar    400.0
baz    600.0
foo    200.0
qux      NaN
dtype: float64
----------------------------------------------------

In [22]:
ser_4.name = 'foobarbazqux'
ser_4.index.name = 'label'
ser_4

label
baz    300.0
bar    200.0
foo    100.0
qux      NaN
Name: foobarbazqux, dtype: float64

In [34]:
import pandas as pd

data_1 = {
    'state': ['VA', 'VA', 'VA', 'MD', 'MD'],
    'year':  [2010, 2011, 2012, 2010, 2011],
    'pop':   [5, 8, 5, 1, 5]  # âœ… Only 5 values
}
df_1 = pd.DataFrame(data_1)
print(data_1)
print('data_1')
print(df_1)

{'state': ['VA', 'VA', 'VA', 'MD', 'MD'], 'year': [2010, 2011, 2012, 2010, 2011], 'pop': [5, 8, 5, 1, 5]}
data_1
  state  year  pop
0    VA  2010    5
1    VA  2011    8
2    VA  2012    5
3    MD  2010    1
4    MD  2011    5

In [35]:
import pandas as pd


df_2 = pd.DataFrame(data_1, columns = ['year', 'state', 'pop'])
df_2

   year state  pop
0  2010    VA    5
1  2011    VA    8
2  2012    VA    5
3  2010    MD    1
4  2011    MD    5

In [36]:
import pandas as pd


df_3 = pd.DataFrame(data_1, columns = ['year', 'state', 'pop', 'unemp'])
df_3

   year state  pop unemp
0  2010    VA    5   NaN
1  2011    VA    8   NaN
2  2012    VA    5   NaN
3  2010    MD    1   NaN
4  2011    MD    5   NaN

In [37]:
df_3['state']

0    VA
1    VA
2    VA
3    MD
4    MD
Name: state, dtype: object

In [38]:
df_3.state

0    VA
1    VA
2    VA
3    MD
4    MD
Name: state, dtype: object

In [ ]:
# Retrieve a row by position
print(df_3)
print("-------------------------------------------------")
print(df_3.iloc[1])

   year state  pop unemp
0  2010    VA    5   NaN
1  2011    VA    8   NaN
2  2012    VA    5   NaN
3  2010    MD    1   NaN
4  2011    MD    5   NaN
-------------------------------------------------
year     2011
state      VA
pop         8
unemp     NaN
Name: 1, dtype: object

In [ ]:
# Assigning values to unemp column
df_3['unemp'] = np.arange(5)
df_3

   year state  pop  unemp
0  2010    VA    5      0
1  2011    VA    8      1
2  2012    VA    5      2
3  2010    MD    1      3
4  2011    MD    5      4

In [44]:
# Assigning a Series to unemp column
import pandas as pd

unemp1 = pd.Series([6.0, 6.0, 6.1], [2, 3, 4])
df_3['unemp'] = unemp1
df_3

   year state  pop  unemp
0  2010    VA    5    NaN
1  2011    VA    8    NaN
2  2012    VA    5    6.0
3  2010    MD    1    6.0
4  2011    MD    5    6.1

In [ ]:
# Assigning same value to new column
df_3['state_dup'] = df_3['state']
df_3

   year state  pop  unemp state_dup
0  2010    VA    5    NaN        VA
1  2011    VA    8    NaN        VA
2  2012    VA    5    6.0        VA
3  2010    MD    1    6.0        MD
4  2011    MD    5    6.1        MD

In [48]:
# Deleting the column
del df_3['state_dup']
df_3

   year state  pop  unemp
0  2010    VA    5    NaN
1  2011    VA    8    NaN
2  2012    VA    5    6.0
3  2010    MD    1    6.0
4  2011    MD    5    6.1

In [ ]:
# Creating a DataFrame from a dictionary
pop = {'VA' : {2013 : 5.1, 2014 : 5.2},
       'MD' : {2014 : 4.0, 2015: 4.1}
}
df_4 = pd.DataFrame(pop)
df_4

       VA   MD
2013  5.1  NaN
2014  5.2  4.0
2015  NaN  4.1

In [51]:
# Tranpose of DataFrame
df_4.T

    2013  2014  2015
VA   5.1   5.2   NaN
MD   NaN   4.0   4.1

In [56]:
# Creating a DataFrame from a dictionary of series
print(df_4)
data_2 = {'VA' : df_4['VA'][1:],
       'MD' : df_4['MD'][2:]
}
df_5 = pd.DataFrame(data_2)
df_5

       VA   MD
2013  5.1  NaN
2014  5.2  4.0
2015  NaN  4.1

       VA   MD
2014  5.2  NaN
2015  NaN  4.1

In [57]:
df_5.index.name = 'year'
df_5

       VA   MD
year
2014  5.2  NaN
2015  NaN  4.1